/*
Да се креира хиерархија на класи за водење на евиденција за лаборатории во еден факултет. За секоја лабораторија е познато името на лабораторијата, името на институтот на кој припаѓа и бројот на работни места во неа. Почетната вредност на лабораторијата е 120000 денари,
а се зголемува за 5% за секое работно место. Лабораториите може да бидат софтверски или хардверски.
За софтверска лабораторија дополнително се чува бројот на софтверите кои се дел од лабораторијата (максимум 15),
низа со насловите на секој софтвер и низа од индикатори која кажува дали софтверот е лиценциран или слободен.
Вкупната вредност на софтверската лабораторија се одредува со тоа што почетната вредност лабораторијата се зголемува 5000 денари по работно место ако софтверот е лиценциран и 5 денари по работно место ако софтверот е слободен.
За хардверска лабораторија дополнително се чува информација за типот на хардверска лабораторија (високострујна или нискострујна), бројот на парчиња хардвер кои се дел од лабораторијата (максимум 30) и низа со цените на секое парче хардвер.
Вредноста на лабораторијата со алати се добива со тоа што на почетната вредност и се додава 100000 ако е високострујна или 2000 ако е нискострујна а потоа на сумата се додава цената на секое од парчињата хардвер што се дел од лабораторијата.
Во секоја од класите да се дефинира конструктор со параметри, методи за печатење на сите информации за објект од соодветната класа и метода за пресметка на вредноста на објект од соодветната класа. */

